In [1]:
# Import necessary module
from sqlalchemy import create_engine
import pandas as pd

In [2]:
# Create engine: engine
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [3]:
con = engine.connect()

In [4]:
table_names = engine.table_names()

C:\Users\Raymnd Diaz\AppData\Local\Temp\ipykernel_25688\2273142574.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  table_names = engine.table_names()

In [5]:
print(table_names)

['Bookings', 'Facilities', 'Members']

In [6]:
df = pd.DataFrame(con.execute("SELECT * FROM Facilities"))

In [7]:
df.head()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000

In [8]:
# q10 query
q10 = con.execute("SELECT name, SUM(guestcost) + SUM(membercost) -  monthlymaintenance - initialoutlay as totalRev FROM Facilities f JOIN Bookings b on b.facid = f.facid GROUP BY name, monthlymaintenance, initialoutlay HAVING totalRev < 1000")

In [9]:
q10df = pd.DataFrame(q10.fetchall())

In [10]:
# no facilities with a total revenue < 1000
q10df.head()

Empty DataFrame
Columns: []
Index: []

In [11]:
# q11 query
q11 = con.execute("SELECT (m1.surname || ' ' || m1.firstname) as member, (m2.surname || ' ' || m2.firstname) as recommendedBy FROM Members m1 JOIN Members m2 on m1.memid = m2.recommendedby ORDER BY recommendedBy ASC")

In [12]:
q11df = pd.DataFrame(q11.fetchall())

In [13]:
q11df.head()

            member   recommendedBy
0  Stibbons Ponder  Bader Florence
1  Stibbons Ponder      Baker Anne
2   Farrell Jemima   Baker Timothy
3       Rownam Tim      Boothe Tim
4     Smith Darren  Butters Gerald

In [14]:
# q12 query
q12 = con.execute("SELECT name, firstname, surname FROM Facilities f JOIN Bookings b ON b.facid = f.facid JOIN Members m ON m.memid = b.memid WHERE m.memid > 0")

In [15]:
q12df = pd.DataFrame(q12.fetchall())

In [16]:
q12df.head()

             name firstname surname
0    Table Tennis    Darren   Smith
1  Massage Room 1    Darren   Smith
2   Snooker Table    Darren   Smith
3      Pool Table    Darren   Smith
4      Pool Table    Darren   Smith

In [17]:
# q13 query
q13 = con.execute("SELECT strftime('%m', starttime) as month, name, COUNT(*) as totalUsage FROM Bookings b JOIN Facilities f ON f.facid = b.facid WHERE memid > 0 GROUP BY month, name")

In [18]:
q13df = pd.DataFrame(q13.fetchall())

In [19]:
q13df.head()

  month             name  totalUsage
0    07  Badminton Court          51
1    07   Massage Room 1          77
2    07   Massage Room 2           4
3    07       Pool Table         103
4    07    Snooker Table          68